---
kind: property
id: P:Autodesk.Revit.DB.Family.StructuralMaterialType
zh: 族
source: html/b8770014-b218-1b8d-c996-d722828429f4.htm
---
# Autodesk.Revit.DB.Family.StructuralMaterialType Property

**中文**: 族

The family's structural material type.

## Syntax (C#)
```csharp
public StructuralMaterialType StructuralMaterialType { get; }
```